### Plan: 16 to add, 0 to change, 0 to destroy.
```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# aws_s3_bucket.app will be created
+ resource "aws_s3_bucket" "app" {
    + acceleration_status         = (known after apply)
    + acl                         = "public-read"
    + arn                         = (known after apply)
    + bucket                      = (known after apply)
    + bucket_domain_name          = (known after apply)
    + bucket_regional_domain_name = (known after apply)
    + force_destroy               = false
    + hosted_zone_id              = (known after apply)
    + id                          = (known after apply)
    + region                      = (known after apply)
    + request_payer               = (known after apply)
    + tags                        = {
        + "Environment" = "stg"
        + "Terraform"   = "true"
      }
    + website_domain              = (known after apply)
    + website_endpoint            = (known after apply)

    + versioning {
        + enabled    = (known after apply)
        + mfa_delete = (known after apply)
      }

    + website {
        + index_document = "index.html"
      }
  }

# aws_s3_bucket_object.app will be created
+ resource "aws_s3_bucket_object" "app" {
    + acl                    = "public-read"
    + bucket                 = (known after apply)
    + content                = "<h1>Welcome to the stg environment</h1>"
    + content_type           = "text/html"
    + etag                   = (known after apply)
    + force_destroy          = false
    + id                     = (known after apply)
    + key                    = "index.html"
    + kms_key_id             = (known after apply)
    + server_side_encryption = (known after apply)
    + storage_class          = (known after apply)
    + tags                   = {
        + "Environment" = "stg"
        + "Terraform"   = "true"
      }
    + version_id             = (known after apply)
  }

# module.vpc.aws_internet_gateway.this[0] will be created
+ resource "aws_internet_gateway" "this" {
    + arn      = (known after apply)
    + id       = (known after apply)
    + owner_id = (known after apply)
    + tags     = {
        + "Environment" = "stg"
        + "Name"        = "tfmultievn909-stg"
        + "Terraform"   = "true"
      }
    + vpc_id   = (known after apply)
  }

# module.vpc.aws_route.public_internet_gateway[0] will be created
+ resource "aws_route" "public_internet_gateway" {
    + destination_cidr_block     = "0.0.0.0/0"
    + destination_prefix_list_id = (known after apply)
    + egress_only_gateway_id     = (known after apply)
    + gateway_id                 = (known after apply)
    + id                         = (known after apply)
    + instance_id                = (known after apply)
    + instance_owner_id          = (known after apply)
    + local_gateway_id           = (known after apply)
    + nat_gateway_id             = (known after apply)
    + network_interface_id       = (known after apply)
    + origin                     = (known after apply)
    + route_table_id             = (known after apply)
    + state                      = (known after apply)

    + timeouts {
        + create = "5m"
      }
  }

# module.vpc.aws_route_table.private[0] will be created
+ resource "aws_route_table" "private" {
    + id               = (known after apply)
    + owner_id         = (known after apply)
    + propagating_vgws = (known after apply)
    + route            = (known after apply)
    + tags             = {
        + "Environment" = "stg"
        + "Name"        = "tfmultievn909-stg-private-eu-west-1a"
        + "Terraform"   = "true"
      }
    + vpc_id           = (known after apply)
  }

# module.vpc.aws_route_table.private[1] will be created
+ resource "aws_route_table" "private" {
    + id               = (known after apply)
    + owner_id         = (known after apply)
    + propagating_vgws = (known after apply)
    + route            = (known after apply)
    + tags             = {
        + "Environment" = "stg"
        + "Name"        = "tfmultievn909-stg-private-eu-west-1b"
        + "Terraform"   = "true"
      }
    + vpc_id           = (known after apply)
  }

# module.vpc.aws_route_table.public[0] will be created
+ resource "aws_route_table" "public" {
    + id               = (known after apply)
    + owner_id         = (known after apply)
    + propagating_vgws = (known after apply)
    + route            = (known after apply)
    + tags             = {
        + "Environment" = "stg"
        + "Name"        = "tfmultievn909-stg-public"
        + "Terraform"   = "true"
      }
    + vpc_id           = (known after apply)
  }

# module.vpc.aws_route_table_association.private[0] will be created
+ resource "aws_route_table_association" "private" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = (known after apply)
  }

# module.vpc.aws_route_table_association.private[1] will be created
+ resource "aws_route_table_association" "private" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = (known after apply)
  }

# module.vpc.aws_route_table_association.public[0] will be created
+ resource "aws_route_table_association" "public" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = (known after apply)
  }

# module.vpc.aws_route_table_association.public[1] will be created
+ resource "aws_route_table_association" "public" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = (known after apply)
  }

# module.vpc.aws_subnet.private[0] will be created
+ resource "aws_subnet" "private" {
    + arn                             = (known after apply)
    + assign_ipv6_address_on_creation = false
    + availability_zone               = "eu-west-1a"
    + availability_zone_id            = (known after apply)
    + cidr_block                      = "10.2.10.0/24"
    + id                              = (known after apply)
    + ipv6_cidr_block_association_id  = (known after apply)
    + map_public_ip_on_launch         = false
    + owner_id                        = (known after apply)
    + tags                            = {
        + "Environment" = "stg"
        + "Name"        = "tfmultievn909-stg-private-eu-west-1a"
        + "Terraform"   = "true"
      }
    + vpc_id                          = (known after apply)
  }

# module.vpc.aws_subnet.private[1] will be created
+ resource "aws_subnet" "private" {
    + arn                             = (known after apply)
    + assign_ipv6_address_on_creation = false
    + availability_zone               = "eu-west-1b"
    + availability_zone_id            = (known after apply)
    + cidr_block                      = "10.2.20.0/24"
    + id                              = (known after apply)
    + ipv6_cidr_block_association_id  = (known after apply)
    + map_public_ip_on_launch         = false
    + owner_id                        = (known after apply)
    + tags                            = {
        + "Environment" = "stg"
        + "Name"        = "tfmultievn909-stg-private-eu-west-1b"
        + "Terraform"   = "true"
      }
    + vpc_id                          = (known after apply)
  }

# module.vpc.aws_subnet.public[0] will be created
+ resource "aws_subnet" "public" {
    + arn                             = (known after apply)
    + assign_ipv6_address_on_creation = false
    + availability_zone               = "eu-west-1a"
    + availability_zone_id            = (known after apply)
    + cidr_block                      = "10.2.1.0/24"
    + id                              = (known after apply)
    + ipv6_cidr_block_association_id  = (known after apply)
    + map_public_ip_on_launch         = true
    + owner_id                        = (known after apply)
    + tags                            = {
        + "Environment" = "stg"
        + "Name"        = "tfmultievn909-stg-public-eu-west-1a"
        + "Terraform"   = "true"
      }
    + vpc_id                          = (known after apply)
  }

# module.vpc.aws_subnet.public[1] will be created
+ resource "aws_subnet" "public" {
    + arn                             = (known after apply)
    + assign_ipv6_address_on_creation = false
    + availability_zone               = "eu-west-1b"
    + availability_zone_id            = (known after apply)
    + cidr_block                      = "10.2.2.0/24"
    + id                              = (known after apply)
    + ipv6_cidr_block_association_id  = (known after apply)
    + map_public_ip_on_launch         = true
    + owner_id                        = (known after apply)
    + tags                            = {
        + "Environment" = "stg"
        + "Name"        = "tfmultievn909-stg-public-eu-west-1b"
        + "Terraform"   = "true"
      }
    + vpc_id                          = (known after apply)
  }

# module.vpc.aws_vpc.this[0] will be created
+ resource "aws_vpc" "this" {
    + arn                              = (known after apply)
    + assign_generated_ipv6_cidr_block = false
    + cidr_block                       = "10.2.0.0/16"
    + default_network_acl_id           = (known after apply)
    + default_route_table_id           = (known after apply)
    + default_security_group_id        = (known after apply)
    + dhcp_options_id                  = (known after apply)
    + enable_classiclink               = (known after apply)
    + enable_classiclink_dns_support   = (known after apply)
    + enable_dns_hostnames             = false
    + enable_dns_support               = true
    + id                               = (known after apply)
    + instance_tenancy                 = "default"
    + ipv6_association_id              = (known after apply)
    + ipv6_cidr_block                  = (known after apply)
    + main_route_table_id              = (known after apply)
    + owner_id                         = (known after apply)
    + tags                             = {
        + "Environment" = "stg"
        + "Name"        = "tfmultievn909-stg"
        + "Terraform"   = "true"
      }
  }

Plan: 16 to add, 0 to change, 0 to destroy.

```
